[
    {
      "title": "Malaysia Food Security Faces Challenges Amid Growing Population",
      "description": "Kuala Lumpur: Nation grapples with food security as population projected to reach 40-42 million by 2050",
      "content": "As Malaysia's population is expected to reach 40-42 million by 2050, ensuring food security becomes a critical concern amidst challenges such as climate change, urbanisation, and reliance on imports.\n\nThe country must tackle these issues while focusing on agricultural productivity, sustainability, and resilience.\n\nMalaysia's food security faces complex challenges and opportunities as its population is projected to reach 40-42 million by 2050.\n\nThe country's food security landscape is marked by a growing population, increasing urbanisation, and changing dietary patterns. Malaysia relies heavily on imports for essential food items, making it vulnerable to global market fluctuations and supply chain disruptions. In 2023, the import value of food reached approximately RM78.7 billion, up from RM75.6 billion in the previous year. This dependency presents economic challenges and increases food security risks.\n\nMalaysia also faces a complex nutritional landscape, with undernutrition and overnutrition existing simultaneously. Around 20.7 per cent of children under five suffer from stunting, and 11.5 per cent from wasting, while half of the adult population is classified as overweight or obese. This dual burden highlights the need for a comprehensive approach to food security that emphasises both availability and nutritional quality.\n\nClimate change is a key driver affecting agricultural productivity and stability. Projections indicate a temperature increase of 1.5°C to 2°C by 2050, with altered rainfall patterns and more frequent extreme weather events. These changes could lead to reduced crop yields, increased pest and disease infestations, and damage to agricultural infrastructure. Rising sea levels and ocean acidification further threaten coastal agriculture and fisheries.\n\nWater management is another critical challenge, with only 50 per cent efficiency in agricultural water use. This inefficiency exacerbates water stress and creates competition with industrial and domestic needs. The farming sector faces significant demographic challenges, including an ageing farmer population (average age over 60 years) and rural-to-urban migration, threatening long-term food security and agricultural productivity.\n\nFinancial constraints, a lack of technical expertise, and cultural resistance are barriers to adopting improved agricultural technology. Malaysia's agricultural productivity growth rate of 1.2 per cent per annum lags behind the regional average of 2.8 per cent, partly due to slower rates of technology adoption.\n\nRecognising these challenges, the Malaysian government has initiated several strategic policies, including the Food Security Policy and the National Agro-Food Policy (NAP 2.0). These policies aim to increase agricultural productivity, enhance food distribution systems, and reduce reliance on imports. Early results show promise, with a 15 per cent increase in domestic food production and a 22 per cent rise in youth participation in agriculture between 2021 and 2023.\n\nSustainable agricultural practices, such as conservation agriculture, agroforestry, and precision farming, present significant potential to enhance food security and environmental sustainability. These approaches can improve soil health, water retention, biodiversity, and ecosystem services.\n\nComplementing these practices, advanced technologies such as precision agriculture, utilising sensors, drones, and AI, can optimise resource use, boost crop yields, and minimise environmental impact. Biotechnology, artificial intelligence, and big data analytics offer promising solutions to address climate change challenges and enhance food security.\n\nUrban agriculture techniques, including vertical farming, rooftop gardens, and community gardens, can contribute to food security in expanding cities. These methods increase local food production and reduce reliance on distant agricultural sources. Agricultural diversification, such as diversifying crops and protein sources, can mitigate risks, improve ecosystem services, and boost farmers' incomes. Expanding aquaculture, improving livestock production, and exploring alternative proteins are essential for reducing import dependence and improving nutritional outcomes.\n\nSmart farming leverages IoT devices to collect real-time data on soil conditions, weather patterns, and crop health. This data is analysed to provide farmers with actionable insights, enabling precise resource management, early pest detection, and optimised crop yields. It promotes sustainable practices by minimising resource waste and environmental impact. Similarly, Climate-Smart Agriculture combines strategies to increase productivity, build resilience to climate change, and reduce emissions. This includes conservation agriculture, agroforestry, improved water management, and crop diversification to ensure sustainable food production in a changing climate.\n\nImproving post-harvest infrastructure through technology can significantly reduce food losses and increase agricultural productivity in countries like Malaysia. This involves upgrading storage, processing, and distribution systems to preserve food quality and extend shelf life.\n\nFood safety enhancement also requires cutting-edge technologies and robust regulations to ensure food quality, prevent contamination, and maintain traceability. This approach protects consumers, builds trust, and enhances the country's reputation in international food markets.\n\nHuman capital development in agriculture focuses on comprehensive education and skill-building programmes. These initiatives aim to equip farmers with knowledge of modern farming techniques, digital literacy, and technological proficiency. By investing in farmers' skills, Malaysia can create a more adaptive, innovative, and productive agricultural workforce, essential for addressing future food security challenges.\n\nLastly, effective governance for food security in Malaysia involves integrating all aspects of the food system, from production to consumption. It emphasises collaboration between government and private sectors and uses data-driven decision-making. This approach ensures policies are comprehensive, practical, and responsive to changing needs, ultimately improving food security outcomes nationwide. By implementing these solutions, Malaysia can significantly enhance its food security, reduce import dependence, and create a more resilient and sustainable food system capable of meeting the needs of its growing population by 2050.\n\nMalaysia's food security challenges by 2050 require a multifaceted approach. While the country faces significant hurdles, there are also numerous opportunities for improvement. Research highlights the importance of sustainable practices, technological adoption, educational initiatives, and effective governance in creating a resilient and sustainable food system capable of meeting the needs of Malaysia's growing population.\n\nIt is recommended that policymakers invest in agricultural education, promote sustainable practices, develop urban agriculture policies, increase funding for agricultural technology research, strengthen public-private partnerships, and implement holistic food system governance strategies.\n\nBy addressing these challenges and capitalising on the identified opportunities, Malaysia can significantly enhance its food security, reduce import dependence, and create a more resilient and sustainable food system capable of meeting the needs of its growing population by 2050.\n\nColonel Shahfreen Baba is a senior officer in the Royal Malaysian Air Force and is currently attending the National Resilience College, in PUSPAHANAS Putrajaya.",
      "source": "Yahoo!news",
      "url": null,
      "published_at": "2024-11-04T07:22:00+00:00",
      "category": "general"
    },
    {
      "title": "2024 Agricultural Census Key to Malaysia's Agriculture Economy",
      "description": "Butterworth: Economy Minister Rafizi reveals preliminary findings from first agricultural census in 20 years",
      "content": "BUTTERWORTH, Nov 2 (Bernama) -- The 2024 Agricultural Census, which concluded on Oct 10, is expected to play a pivotal role in accelerating efforts to develop Malaysia's agriculture-based economy.Economy Minister Rafizi Ramli said the data collected from this census, conducted by the Department of Statistics Malaysia (DOSM), is currently being analysed and will soon be presented to the government.\n\"The last Agricultural Census was held in 2005, meaning we have spent the last 20 years planning for food security, the food sector and agricultural employment based on outdated benchmarks that haven't been reviewed in two decades,\" he said.\n\"Although we are still analysing the data and will present the final results to the government shortly, initial findings suggest that the actual agricultural capacity in our country is lower than previously reported,\" Rafizi said in his speech at DOSM 75th Diamond Jubilee celebration which was officiated by Prime Minister Datuk Seri Anwar Ibrahim here today.\n\nIn a bid to enhance the delivery of government services and benefits to all citizens, Rafizi said DOSM is actively analysing and managing data down to the district level.\nHe added that DOSM has also taken steps to release several key statistics at the state assembly level.",
      "source": "Bernama",
      "url": "https://www.bernama.com/en/economy/news.php?id=2024110201",
      "published_at": "2024-11-02T18:17:00+00:00",
      "category": "general"
    },
    {
      "title": "Meraque Group Partners with Uzbekistan for Agricultural Technology",
      "description": "Kuala Lumpur: Malaysian robotics firm signs MoU with Uzbekistan Ministry of Agriculture for US$4.6M facility",
      "content": "Meraque Group, a leading Malaysian robotics solutions company, announced the establishment of a strategic partnership with the Ministry of Agriculture of the Republic of Uzbekistan, highlighting their mutual commitment to driving innovation, collaboration, and growth in the agricultural technology sector.\n\nThe partnership was formalised through a MoU, signed by Shakhobjon Sharifov, Director of the State Institution (Administrative and Economic Service), and Razali Ismail, CEO and founder of Meraque, witnessed by Ibrokhim Y. Abdurakhmonov, Minister of Agriculture of the Republic of Uzbekistan.\n\n\"We believe that this strategic partnership will not only enhance our capabilities but also contribute to the broader goal of sustainable agricultural development. We are committed to working closely with the Ministry of Agriculture to create cutting-edge solutions that will benefit both nations,\" said Razali Ismail, CEO and founder of Meraque.\n\nUzbekistan boasts an extensive agricultural landscape, with approximately 4.3 million hectares of land dedicated to farming, including 1 million hectares for cotton and another million for various other crops. The country is also actively expanding its horticulture sector, focusing on fruit and vegetable production. Recognising the vast market potential, Meraque said it views this partnership as an opportunity to extend its expertise in drone technology and robotic solutions to revolutionise Uzbekistan's agricultural sector.\n\nWithin the next three years, Meraque aims to secure a US$4.6 million (RM20 million) facility from a Malaysian bank to establish a cutting-edge manufacturing facility in Uzbekistan. This initiative is expected to generate 1,000 new jobs and service 100,000 hectares of agricultural land, contributing an estimated US$13.8 million (RM60 million) in value. Furthermore, Razali, who has bootstrapped the startup since its 2018 launch now plans to raise RM30 million in VC funding to fuel further advancements in agricultural technology across the region.\n\n[RM1 = US$0.23]\n\nOne key aspect of the partnership is Meraque's role in working closely with the Uzbekistan Ministry of Agriculture to develop a comprehensive drone ecosystem policy tailored for agriculture. This policy will aim to regulate and enhance the use of drone technology within the country's vast agricultural sector, ensuring sustainable growth and efficiency improvements.\n\nThe partnership will prioritise education and knowledge-sharing, focusing on training programs, governance of drone ecosystems, and servicing within the agricultural sector. With oversight of 100,000 farmers, the Ministry of Agriculture of Uzbekistan is poised to benefit from improved efficiency, productivity, and sustainability through this partnership.",
      "source": "Digital News Asia",
      "url": null,
      "published_at": "2024-09-10T10:00:00+00:00",
      "category": "Technology"
    },
    {
      "title": "Malaysia, Philippines to Strengthen Agricultural Cooperation",
      "description": "Kuala Lumpur: Agriculture Minister meets Philippine Ambassador to discuss technical and trade cooperation",
      "content": "KUALA LUMPUR, July 18 (Bernama) -- Malaysia is ready to sign a letter of intent (LOI) with the Philippines to strengthen technical and trade cooperation in agriculture, said Agriculture and Food Security Minister Datuk Seri Mohamad Sabu\nHe disclosed that the topic was addressed during his meeting with Philippine Ambassador to Malaysia Maria Angela Abrera Ponce at Menara Lembaga Pertubuhan Peladang.\n\"I was informed that she (Ponce) was tasked by the Philippine government to strengthen agricultural cooperation with Malaysia, considering we are the largest trading partner for the Philippine agricultural sector within ASEAN,\" he said in a Facebook post today. This meeting marked the first encounter since Ponce commenced her tenure in Malaysia at the end of November 2023.\nMohamad also extended an invitation to the Philippines to participate in the 2024 Agriculture, Horticulture, and Agro Tourism Exhibition (MAHA), scheduled from Sept 11 to 22.",
      "source": "Bernama",
      "url": "https://www.bernama.com/en/general/news.php?id=2024071801",
      "published_at": "2024-07-18T16:41:00+00:00",
      "category": "general"
    },
    {
      "title": "Johor Leads Malaysia's Agricultural Sector with RM17.2B Contribution",
      "description": "Kluang: State's agricultural sector becomes third-largest GDP contributor with 11.6 percent share",
      "content": "KLUANG: Johor's stability, bolstered by its clear vision, mission and strategic agricultural agenda, has propelled the state to become a leading contributor to Malaysia's agricultural sector.\n\nDeputy Minister of Agriculture and Food Security Datuk Arthur Joseph Kurup said Johor's economic performance in 2023 has been impressive, with a 4.1 per cent growth in gross domestic product (GDP), translating to RM148.2 billion.\n\nHe said this success was supported by several important factors, including the strong collaboration with the Federal Government and strong commitment from grassroots farmers, breeders and fishermen.\n\"Out of that total, the agricultural sector was the third-largest contributor to Johor's GDP, accounting for 11.6 per cent or RM17.2 billion.\n\n\"This cements Johor's position as the top contributor to Malaysia's agricultural sector,\" he said at a press conference held in conjunction with an engagement session with farmers, breeders and fishermen at the Kluang Area Farmers' Organisation here today.\n\nAlso present was State Agriculture, Agro-based Industry and Rural Development Committee chairman Datuk Zahari Sarip. Arthur expressed his gratitude to Johor's agricultural community, commending their hard work and sacrifices in safeguarding the country's food security.\n\nHe said Johor's crop sub-sector made the largest contribution to its agricultural output, accounting for 67.88 per cent, followed by livestock at 25.36 per cent and fisheries at 6.59 per cent.\n\nJohor has also earned recognition as the nation's largest pineapple producer, and boasts the largest Permanent Food Production Park for livestock, which support high-impact ruminant farming projects.\nHe said the Federal Government, through the Ministry of Agriculture and Food Security (KPKM) will continue to support Johor's initiatives in strengthening the national agri-food agenda, while noting that today's event is a manifestation of that commitment.\n\nFor 2024, KPKM has allocated RM70.12 million to Johor to implement various development projects across the livestock, crops and aquaculture sectors, including the Modern Agricultural Infrastructure Development Project in Kluang.\n\n\"This programme, the first of its kind, represents KPKM's 'Quick Win' initiative with the state government, aimed at launching high-impact projects such as the Johor Future Agropreneur (JFA) initiative and the Empowerment of Johor Permanent Food Production Parks Programme,\" he added.",
      "source": "Bernama",
      "url": "https://www.bernama.com/en/economy/news.php?id=2024091201",
      "published_at": "2024-09-12T14:30:00+00:00",
      "category": "general"
    }
  ]