[
  {
    "title": "Khazanah, PNB perjelas isu pelupusan pegangan dalam FashionValet",
    "description": "Kuala Lumpur: Khazanah Nasional Bhd dan Permodalan Nasional Bhd (PNB) hari ini mengeluarkan kenyataan berasingan mengenai kerugian sebanyak RM43.9 juta yang dialami kedua-dua syarikat itu setelah menjual pegangan dalam platform e-dagang Fashion Valet Sdn Bhd dengan harga RM3.1 juta. &copy; New Straits Times Press (M) Bhd",
    "content": "Kuala Lumpur: Khazanah Nasional Bhd dan Permodalan Nasional Bhd (PNB) hari ini mengeluarkan kenyataan berasingan mengenai kerugian sebanyak RM43.9 juta yang dialami kedua-dua syarikat itu setelah menjual pegangan dalam platform e-dagang Fashion Valet Sdn Bhd dengan harga RM3.1 juta. &copy; New Straits Times Press (M) Bhd",
    "source": "myMetro",
    "url": "https://www.hmetro.com.my/utama/2024/11/1150512/khazanah-pnb-perjelas-isu-pelupusan-pegangan-dalam-fashionvalet",
    "published_at": "2024-11-01T16:22:32+00:00",
    "category": "general"
  },
  {
    "title": "1MDB: Pertuduhan terhadap Najib sah dan tidak cacat",
    "description": "Kuala Lumpur: Pertuduhan yang dikemukakan terhadap bekas Perdana Menteri Datuk Seri Najib Razak adalah sah dan tidak cacat di sisi undang-undang, kata Mahkamah Tinggi. &copy; New Straits Times Press (M) Bhd",
    "content": "Kuala Lumpur: Pertuduhan yang dikemukakan terhadap bekas Perdana Menteri Datuk Seri Najib Razak adalah sah dan tidak cacat di sisi undang-undang, kata Mahkamah Tinggi. &copy; New Straits Times Press (M) Bhd",
    "source": "myMetro",
    "url": "https://www.hmetro.com.my/utama/2024/10/1149738/1mdb-pertuduhan-terhadap-najib-sah-dan-tidak-cacat",
    "published_at": "2024-10-30T02:27:43+00:00",
    "category": "general"
  },
  {
    "title": "EMPOWERING CONSUMER RIGHTS IN MALAYSIA",
    "description": "Consumer rights are gaining prominence in Malaysia as the nation grapples with increasingly complex marketplace dynamics and a growing need for consumer protection in the digital age. Read full story",
    "content": "Wednesday, 30 Oct 2024 Consumer rights are gaining prominence in Malaysia as the nation grapples with increasingly complex marketplace dynamics and a growing need for consumer protection in the digital age. The rise in e-commerce and technological advancements has heightened the risk of consumers falling victim to unscrupulous practices, making awareness and empowerment more critical than ever. “Consumer awareness in Malaysia is currently at a moderate level,” said Domestic Trade and Cost of Living Ministry director (Consumerism Movement) Zaid Idris. Zaid Idris highlights the importance of education and awareness in boosting consumer empowerment and protection. In an interview, Zaid referenced the 2020 Consumer Empowerment Index (CEI) study conducted by the ministry, which revealed a consumer empowerment score of 63.1% across three key areas: consumer skills and knowledge, financial literacy and consumer involvement. While Malaysia fared better than the European Union (50%) and Indonesia (48%) in their latest respective studies, it trails slightly behind South Korea (65%). This is a benchmark, he remarked, indicating that there are plans for a follow-up study in 2025 or 2026 to measure progress. While Malaysian consumers scored well on understanding basic financial products, they lagged in making claims for compensation, with a score of 56.1%. “Consumers know what to do, but they do not take action,” Zaid explained, pointing out a cultural tendency to rely on authorities instead of self-advocacy. Recognising these gaps, the ministry has launched several initiatives to boost consumer involvement. Prime Minister Datuk Seri Anwar Ibrahim recently officiated the government’s “Kita Gempur” campaign to combat unethical business practices. The initiative aims to address issues such as online business fraud and cartel behaviour. As reported by The Star on Oct 19, 2024, the initiative includes a reporting platform accessible through QR codes, enabling the public to report misconduct via WhatsApp, hotline and MyCC portal. The ministry plans to display these QR codes prominently in various locations across Malaysia to facilitate efficient reporting. The ministry has also been promoting the Tribunal for Consumer Claims Malaysia (TTPM) as a quick, easy and affordable avenue for consumers to file claims. “It’s a quasi-judicial process that costs only RM5 and can handle claims up to RM50,000,” Zaid noted, emphasising its accessibility compared to the traditional court system. TTPM aims to resolve cases within 60 days, although the timeline can vary based on case complexity. Consumer rights and protection Consumers in Malaysia have eight fundamental rights to safeguard them from unscrupulous practices. These rights include access to basic needs, the right to make choices, the right to secure goods and services, accurate information, the ability to voice opinions, access to live in a safe and healthy environment and the right to consumer education. Importantly, consumers also have the right to fair compensation for misleading or poor-quality goods and services. “An informed consumer is an empowered consumer,” Zaid emphasised. Filing claims can be done through straightforward means, either manually at one of the TTPM branches or online via the e-Tribunal V3 system. If a defendant fails to comply with a TTPM decision, the ministry can take enforcement action, potentially leading to criminal charges. Channels for complaints and claims The ministry has developed various channels for consumers to lodge complaints, including the e-Aduan portal, a hotline, and various digital platforms. Additionally, consumers can submit claims through manual submissions at TTPM counters or online. Zaid stressed the importance of consumer participation in enhancing consumer rights in Malaysia. “We need to improve the mentality of our society,” he remarked, encouraging Malaysians to take an active role in asserting their rights. The upcoming CEI study will serve as a crucial tool in measuring advancements and identifying areas for further improvement. Zaid stressed that the ministry is committed to fostering a balanced and ethical consumer ecosystem, where informed consumers can make educated purchasing decisions and assert their rights confidently. As Malaysia continues to develop, empowering consumers remains a fundamental goal in achieving a socially and economically balanced nation. A key aspect of consumer empowerment is ensuring that consumers are well-informed. “It’s crucial for consumers to have knowledge and make sound decisions,” Zaid pointed out. For instance, when purchasing food products, consumers should be aware of ingredients and nutritional content as indicated on labels. This transparency is part of the government’s effort to protect consumer rights by providing necessary information, allowing consumers to make informed choices. The ministry also emphasises the importance of manufacturers providing clear contact information, ensuring consumers know who to reach out to if issues arise. By equipping consumers with the right knowledge and encouraging proactive engagement, the ministry aims to elevate consumer rights and protection in Malaysia. For enquiries and complaints, Whatsapp to 019-848 8000, call the KPDN hotline at 1-800 886 800 or visit eaduan.kpdn.gov.my from 9am to 5pm, Monday to Friday (Sunday to Thursday in Johor, Kedah, Kelantan and Terengganu. Or download the KPDN app ezAdu via the Apple App Store or Google Play Store. For more information, visit www.kpdn.gov.my/ms/ Tags / Keywords:\nKPDN\n                                                                ,\n                                                                                                consumer rights\n                                                                ,\n                                                                                                empowering consumers  Report it to us. Thank you for your report! ",
    "source": "The Star online",
    "url": "https://www.thestar.com.my/news/nation/2024/10/30/empowering-consumer-rights-in-malaysia",
    "published_at": "2024-10-29T23:00:00+00:00",
    "category": "general"
  },
  {
    "title": "GST still the better option, says Dr Wee",
    "description": "KUALA LUMPUR: Datuk Seri Dr Wee Ka Siong has reiterated that the goods and services tax (GST) remains Malaysia’s better option for an efficient taxation and subsidy system. Read full story",
    "content": "Monday, 28 Oct 2024 KUALA LUMPUR: Datuk Seri Dr Wee Ka Siong (pic) has reiterated that the goods and services tax (GST) remains Malaysia’s better option for an efficient taxation and subsidy system. The MCA president shared in a two-minute video on social media that he had done his research on the Budget 2025 and understood that the national debt has reached RM1.2 trillion. \"This is almost twice as much as in the pre-2018 era, but I want to repeat my stance on a better way to increase the government's income through taxes and subsidies, which is through GST. \"There is room for manipulation when it comes to the sales and service tax (SST). \"Which is why the government had to implement other efforts like e-invoicing to deal with it, which is quite cumbersome for everyone,\" he said in the video posted on his official Facebook page on Monday (Oct 28). Dr Wee, said on the other hand, GST is fairer because it is a tax based on the expenses of those who spend extravagantly on luxury goods or luxury cars. \"It is that person who has to pay more and that is why this concept is fairer. He said another proposal is to impose a petrol levy during road tax renewal every year. \"If a person can afford to buy a car for more than RM300,000 or RM500,000, they must be able to pay extra for example, RM2,600 a year as a petrol levy. \"The government can impose this levy on cars valued at more than RM300,000,\" he said. Dr Wee said that as he has raised in Parliament recently, this method is easier compared to the two-tier subsidy system proposed by the government. \"Here only one subsidised petrol price is required across the country and the government can still collect funds from those who can afford it,\" he said. He reminded that one should not forget that before 2018, the then Barisan Nasional-led government were dubbed tyrants for not lowering the petrol prices. \"In the past, it was Pakatan Harapan's promise to lower petrol prices,\" he said.  Tags / Keywords:\nWee Ka Siong\n                                                                ,\n                                                                                                GST\n                                                                ,\n                                                                                                Subsidy\n                                                                ,\n                                                                                                Petrol\n                                                                ,\n                                                                                                Parliament\n                                                                ,\n                                                                                                National Debt\n                                                                ,\n                                                                                                MCA\n                                                                ,\n                                                                                                Luxury Cars\n                                                                ,\n                                                                                                Petrol Levy\n                                                                ,\n                                                                                                Pakatan Harapan\n                                                                ,\n                                                                                                Barisan Nasional\n                                                                ,\n                                                                                                Goods and Services Tax\n                                                                ,\n                                                                                                Taxation\n                                                                ,\n                                                                                                Income\n                                                                ,  Report it to us. Thank you for your report! ",
    "source": "The Star online",
    "url": "https://www.thestar.com.my/news/nation/2024/10/28/gst-still-the-better-option-says-dr-wee",
    "published_at": "2024-10-28T08:41:00+00:00",
    "category": "general"
  }
]